nathanfraske/CEC-Platform/firmware/esp/proto/atx-24pin/sdkconfig.defaults
# CEC 24-pin Module — sdkconfig defaults for ESP32-S3-MINI-1 N4R2
#
# Generate sdkconfig from this with: idf.py set-target esp32s3 && idf.py menuconfig
# (the menuconfig step picks up these defaults; modify them there for tuning)

# Target
CONFIG_IDF_TARGET="esp32s3"

# Flash size (ESP32-S3-MINI-1-N4R2 has 4 MB flash)
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="4MB"

# PSRAM (ESP32-S3-MINI-1-N4R2 has 2 MB QUAD PSRAM -- not the WROOM N16R8's octal 8 MB.
# TYPE_AUTO detects the 2 MB; MODE_QUAD is the in-package R2 PSRAM interface.)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_QUAD=y
CONFIG_SPIRAM_TYPE_AUTO=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_BOOT_INIT=y
CONFIG_SPIRAM_USE_MALLOC=y

# CPU frequency
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

# Custom partition table (OTA layout: ota_0 / ota_1 / otadata)
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# CAN-OTA safety: a freshly CAN-flashed image boots in PENDING_VERIFY; if it
# fails to call esp_ota_mark_app_valid (cec_canota_mark_valid, in app_main)
# the bootloader rolls back to the previous slot on the next reset.
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

# Disable WiFi and BT in the bootloader to save startup time and memory
# (we don't use either)
CONFIG_ESP_WIFI_ENABLED=n
CONFIG_BT_ENABLED=n

# USB CDC for high-speed Serial via native USB
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# Log level (can be tightened in production)
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# Compiler optimization
CONFIG_COMPILER_OPTIMIZATION_PERF=y

# CEC sensor selection (shared cec_sensors component). PRODUCTION board: 4x
# INA228 (one per rail, bus voltage + current). The divider/ACS712/INA226 dev-
# board front end is retired -- main.c reads only the INA228s now. (The ADC
# backend choice is required by Kconfig but cec_adc is otherwise unused here.)
CONFIG_CEC_ADC_BACKEND_CONTINUOUS=y
CONFIG_CEC_SENSOR_INA228=y

# TelePlot transport. The PRODUCTION 24-pin board has ONLY the MCU's native
# USB Serial/JTAG -- no CH340K UART bridge (that was the dev board). So route
# TelePlot + burst dumps to stdio (the console), interleaved with the logs +
# CLI, so everything rides the one USB-C cable. (=y would send them to the
# dedicated 921600 UART on GPIO43/44, which the production board doesn't break out.)
CONFIG_CEC_TELEMETRY_UART0=n

# CAN (TWAI) telemetry to the Hub. Transceiver U2 = TJA1051T/3; MCU CAN TX on
# IO17 (-> TXD), CAN RX on IO18 (<- RXD), traced from the board netlist.
# Bitrate 125k = the reliable bench rate (the Hub's SN65HVD230 breakout is
# slope-controlled and bus-offs at 500k unless its Rs pin is bridged to GND);
# 500k is the platform target. The Hub MUST use the SAME bitrate.
CONFIG_CEC_CAN_TX_GPIO=17
CONFIG_CEC_CAN_RX_GPIO=18
CONFIG_CEC_CAN_BITRATE_BPS=125000
